test/invoice/invoice-preview-response.xml

<invoice_collection>
  <charge_invoice href="">
    <account href="https://your-subdomain.recurly.com/v2/accounts/1"/>
    <address>
      <address1>123 Main St.</address1>
      <address2 nil="nil"/>
      <city>San Francisco</city>
      <state>CA</state>
      <zip>94105</zip>
      <country>US</country>
      <phone nil="nil"/>
    </address>
    <uuid>43adb84ff8e763a22adb7542858f41fc</uuid>
    <state>pending</state>
    <invoice_number_prefix/>
    <invoice_number nil="nil"/>
    <vat_number nil="nil"/>
    <tax_in_cents type="integer">425</tax_in_cents>
    <total_in_cents type="integer">3425</total_in_cents>
    <currency>USD</currency>
    <created_at nil="nil"/>
    <updated_at nil="nil"/>
    <attempt_next_collection_at type="datetime">2018-03-20T15:42:26Z</attempt_next_collection_at>
    <closed_at nil="nil"/>
    <customer_notes nil="nil"/>
    <recovery_reason nil="nil"/>
    <subtotal_before_discount_in_cents type="integer">5000</subtotal_before_discount_in_cents>
    <subtotal_in_cents type="integer">3000</subtotal_in_cents>
    <discount_in_cents type="integer">0</discount_in_cents>
    <due_on type="datetime">2018-03-20T15:42:26Z</due_on>
    <net_terms type="integer">0</net_terms>
    <collection_method>manual</collection_method>
    <po_number nil="nil"/>
    <terms_and_conditions nil="nil"/>
    <tax_type>usst</tax_type>
    <tax_region>CA</tax_region>
    <tax_rate type="float">0.085</tax_rate>
    <line_items type="array">
      <adjustment href="https://your-subdomain.recurly.com/v2/adjustments/43adb5a639dc950ff620de42e6be4141" type="charge">
        <!-- Detail. -->
        </adjustment>
    </line_items>
    <transactions type="array">
    </transactions>
  </charge_invoice>
  <credit_invoices type="array">
  </credit_invoices>
</invoice_collection>
