test/invoice/list-response.xml

<invoices type="array">
  <invoice href="https://your-subdomain.recurly.com/v2/invoices/1013">
    <account href="https://your-subdomain.recurly.com/v2/accounts/1"/>
    <address>
      <address1>123 Main St.</address1>
      <address2 nil="nil"/>
      <city>San Francisco</city>
      <state>CA</state>
      <zip>94105</zip>
      <country>US</country>
      <phone nil="nil"/>
    </address>
    <subscriptions href="https://your-subdomain.recurly.com/v2/invoices/1013/subscriptions"/>
    <uuid>3c42a34e49efd60b2a79194993967a22</uuid>
    <state>paid</state>
    <invoice_number_prefix/>
    <invoice_number type="integer">1013</invoice_number>
    <vat_number nil="nil"/>
    <tax_in_cents type="integer">424</tax_in_cents>
    <total_in_cents type="integer">5274</total_in_cents>
    <currency>EUR</currency>
    <created_at type="datetime">2017-03-15T21:20:36Z</created_at>
    <updated_at type="datetime">2017-03-15T21:20:36Z</updated_at>
    <attempt_next_collection_at nil="nil"/>
    <closed_at type="datetime">2017-03-15T21:20:36Z</closed_at>
    <customer_notes nil="nil"/>
    <recovery_reason nil="nil"/>
    <subtotal_before_discount_in_cents type="integer">5300</subtotal_before_discount_in_cents>
    <subtotal_in_cents type="integer">4850</subtotal_in_cents>
    <discount_in_cents type="integer">450</discount_in_cents>
    <due_on type="datetime">2017-03-15T21:20:37Z</due_on>
    <net_terms type="integer">0</net_terms>
    <collection_method>automatic</collection_method>
    <po_number nil="nil"/>
    <terms_and_conditions nil="nil"/>
    <tax_type>usst</tax_type>
    <tax_region>CA</tax_region>
    <tax_rate type="float">0.0875</tax_rate>
    <redemptions href="https://your-subdomain.recurly.com/v2/invoices/1013/redemptions"/>
    <line_items type="array">
      <adjustment href="https://your-subdomain.recurly.com/v2/adjustments/3c42a34e416c81f66c267d44a5b7d610" type="charge">
        <account href="https://your-subdomain.recurly.com/v2/accounts/1"/>
        <invoice href="https://your-subdomain.recurly.com/v2/invoices/1013"/>
        <subscription href="https://your-subdomain.recurly.com/v2/subscriptions/3c42a34d1442f840373a4b40de85a80a"/>
        <uuid>3c42a34e416c81f66c267d44a5b7d610</uuid>
        <state>invoiced</state>
        <description>Setup fee: Gold plan</description>
        <accounting_code nil="nil"/>
        <product_code>gold</product_code>
        <origin>setup_fee</origin>
        <unit_amount_in_cents type="integer">800</unit_amount_in_cents>
        <quantity type="integer">1</quantity>
        <discount_in_cents type="integer">0</discount_in_cents>
        <tax_in_cents type="integer">70</tax_in_cents>
        <total_in_cents type="integer">870</total_in_cents>
        <currency>EUR</currency>
        <proration_rate nil="nil"/>
        <taxable type="boolean">false</taxable>
        <tax_type>usst</tax_type>
        <tax_region>CA</tax_region>
        <tax_rate type="float">0.0875</tax_rate>
        <tax_exempt type="boolean">false</tax_exempt>
        <tax_code nil="nil"/>
        <start_date type="datetime">2017-03-15T21:20:36Z</start_date>
        <end_date nil="nil"/>
        <created_at type="datetime">2017-03-15T21:20:37Z</created_at>
        <updated_at type="datetime">2017-03-15T21:20:37Z</updated_at>
        <revenue_schedule_type>evenly</revenue_schedule_type>
      </adjustment>
      <!-- Continued... -->
    </line_items>
    <transactions type="array">
      <!-- Detail. -->
    </transactions>
    <a name="refund" href="https://your-subdomain.recurly.com/v2/invoices/1013/refund" method="post"/>
  </invoice>
  <!-- Continued... -->
</invoices>
