test/invoice/single-response.xml

<invoice href="https://your-subdomain.recurly.com/v2/invoices/1007">
  <account href="https://your-subdomain.recurly.com/v2/accounts/1"/>
    <subscriptions href="https://your-subdomain.recurly.com/v2/invoices/1007/subscriptions"/>
  <address>
    <address1>123 Main St.</address1>
    <address2 nil="nil"/>
    <city>San Francisco</city>
    <state>CA</state>
    <zip>94105</zip>
    <country>US</country>
    <phone nil="nil"/>
  </address>
  <shipping_address>
    <name>Lon Doner</name>
    <address1>221B Baker St.</address1>
    <address2></address2>
    <city>London</city>
    <state></state>
    <zip>W1K 6AH</zip>
    <country>GB</country>
    <phone></phone>
  </shipping_address>
  <uuid>37c0057d2f641f4e2fcbda4b5b833633</uuid>
  <state>paid</state>
  <invoice_number_prefix/>
  <invoice_number type="integer">1007</invoice_number>
  <po_number nil="nil"/>
  <vat_number nil="nil"/>
  <subtotal_in_cents type="integer">2000</subtotal_in_cents>
  <discount_in_cents type="integer">0</discount_in_cents>
  <due_on type="datetime">2018-01-30T21:11:50Z</due_on>
  <balance_in_cents type="integer">0</balance_in_cents>
  <type>charge</type>
  <origin>purchase</origin>
  <credit_invoices href="https://your-subdomain.recurly.com/v2/invoices/1325/credit_invoices"/>
  <refundable_total_in_cents type="integer">2000</refundable_total_in_cents>
  <credit_payments type="array">
  </credit_payments>
  <tax_in_cents type="integer">424</tax_in_cents>
  <total_in_cents type="integer">5274</total_in_cents>
  <currency>EUR</currency>
  <created_at type="datetime">2016-08-03T16:26:26Z</created_at>
  <updated_at type="datetime">2016-08-03T16:26:26Z</updated_at>
  <closed_at type="datetime">2016-08-03T16:26:26Z</closed_at>
  <terms_and_conditions nil="nil"/>
  <customer_notes nil="nil"/>
  <tax_type>usst</tax_type>
  <tax_region>CA</tax_region>
  <tax_rate type="float">0.0875</tax_rate>
  <net_terms type="integer">0</net_terms>
  <collection_method>automatic</collection_method>
  <redemptions href="https://your-subdomain.recurly.com/v2/invoices/1007/redemptions"/>
  <line_items type="array">
    <adjustment href="https://your-subdomain.recurly.com/v2/adjustments/37c0057d2a3ace0c3f3d674ae89fdabd" type="charge">
      <!-- Detail. -->
    </adjustment>
  </line_items>
  <transactions type="array">
    <transaction href="https://your-subdomain.recurly.com/v2/transactions/37c0057d602b0e1d873d85442187730c" type="credit_card">
      <!-- Detail. -->
    </transaction>
  </transactions>
  <a name="refund" href="https://your-subdomain.recurly.com/v2/invoices/1007/refund" method="post"/>
</invoice>
